"use strict";
let a = 1 + 2 + 3;
alert(a); // Создайте переменную. Запишите в нее сумму чисел 1, 2 и 3.

let b = 10;
let c = 2;
alert(b + c);
alert(b - c);
alert(b / c);
alert(b * c); // Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное (результат деления).

let d = b - c; // Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.
let e = 7;
result = d + e;
alert(result); // Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

let f = 1.5;
let g = 0.75;
alert(f + g); // Запишите в переменную a число 1.5, а в переменную b - число 0.75. Найдите сумму значений этих переменных и выведите ее на экран.

let h = 13;
let i = 5;
alert(h % i); // Найдите остаток от деления.

let name = "Nastya Shamova";
alert(name); // Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные на экран.
alert(name.lenght); // Запишите в переменную какую-нибудь строку. Выведите на экран длину вашей строки.
