"use strict";
let a = 1 + 2 + 3;
alert(a); // Создайте переменную. Запишите в нее сумму чисел 1, 2 и 3.

let b = 10;
let c = 2;
alert(b + c);
alert(b - c);
alert(b / c);
alert(b * c); // Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное (результат деления).

let d = b - c; // Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.
let e = 7;
result = d + e;
alert(result); // Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

let f = 1.5;
git;
let g = 0.75;
alert(f + g); // Запишите в переменную a число 1.5, а в переменную b - число 0.75. Найдите сумму значений этих переменных и выведите ее на экран.

let h = 13;
let i = 5;
alert(h % i); // Найдите остаток от деления.

let name = "Nastya Shamova";
alert(name); // Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные на экран.
alert(name.lenght); // Запишите в переменную какую-нибудь строку. Выведите на экран длину вашей строки.

let num = parseInt("5px");
let num1 = parseInt("6px");
alert(num + num1); // Дана переменная со значением '5px' и переменная со значением '6px'. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.

let num3 = parseFloat("5.5px");
let num4 = parseFloat("6.25px");
alert(num3 + num4); // Дана переменная со значением '5.5px' и переменная со значением '6.25px'. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.
alert(num3 + num4 + "px"); // Модифицируйте предыдущую задачу так, чтобы к выводящемуся результату добавлялись буквы 'px'.

let num5 = 1;
let num6 = 2;
alert(String(num5) + String(num6)); // Даны две переменные с числами. Сложите значения этих переменных как строки и выведите результат на экран.

let num7 = 12345678;
alert(String(num7).length); // Дана переменная с числом. Найдите количество цифр в этом числе.
